<?php
/**
 * index.php is the /music/song/index.php content
 *
 * PHP version 5
 *
 * @category PHP
 * @package  /music/song/
 * @author   Fukuball Lin <fukuball@gmail.com>
 * @license  No Licence
 * @version  Release: <1.0>
 * @link     http://sarasti.cs.nccu.edu.tw
 */
if (!empty($_GET['song_id'])) {
?>
<ul class="breadcrumb">
   <li>
      <a href="<?=SITE_HOST?>/music">歌曲列表</a> <span class="divider">/</span>
   </li>
   <li class="active">
      歌曲資料
   </li>
</ul>
<?php
   $model_id = 2;
   if (!empty($_GET['model_id'])) {
      $model_id = $_GET['model_id'];
   }
   $lmodel_id = 10;
   if (!empty($_GET['lmodel_id'])) {
      $lmodel_id = $_GET['lmodel_id'];
   }
   $song_obj = new LMSong($_GET['song_id']);
   $disc_obj = new LMDisc($song_obj->disc_id);
   $performer_obj = new LMPerformer($song_obj->performer_id);
   $lyricist_obj = new LMLyricist($song_obj->lyricist_id);
   $composer_obj = new LMComposer($song_obj->composer_id);
?>
<div id='song-item-block'>
   <div class="row">
      <div class="flow-left" style="width:300px;">
         <a href="#" class="thumbnail">
            <img src="<?=$disc_obj->cover_path?>" alt="cover">
         </a>
      </div>
      <div class="flow-left" style="width:300px;margin-left:30px;">
         <h2><?=$song_obj->title?></h2>
         <h3>專輯：<?=$disc_obj->title?></h3>
         <h3>音樂人：<?=$performer_obj->name?></h3>
         <h3>作詞：<?=$lyricist_obj->name?></h3>
         <h3>作曲：<?=$composer_obj->name?></h3>
         <h3>類型：<?=$song_obj->genre?></h3>
         <h3>發行：<?=$song_obj->release_date?></h3>
         <hr />
         <?php
         if (!empty($song_obj->audio_path)) {
         ?>
         <p id="audioplayer">Load Song</p>
         <script type="text/javascript">
         AudioPlayer.embed("audioplayer", {
             soundFile: "<?=$song_obj->getAudioUrl()?>",
             titles: "<?=$song_obj->title?>",
             artists: "<?=$performer_obj->name?>",
             autostart: "no"
         });
         </script>
         <?php
         }
         ?>
      </div>
      <div class="flow-left" style="width:340px;margin-left:30px;">
         <h3>歌詞</h3>
         <p><?=nl2br($song_obj->lyric)?></p>
      </div>
   </div>
   <hr />
   <h2>
      歌詞特徵值
   </h2>
   <table class="table table-bordered table-striped">
      <thead>
         <tr>
            <th>種類</th>
            <th>Feature</th>
         </tr>
      </thead>
      <tbody>
         <tr>
            <td rowspan="1">Term Frequency</td>
            <td colspan="2" width="800">
               <?php

               $db_obj = LMDBAccess::getInstance();
               $select_sql = "SELECT term,pos,tf,tfidf FROM lyrics_term_tfidf WHERE song_id='".$_GET['song_id']."' AND is_deleted=0 ORDER BY term";
               $query_result = $db_obj->selectCommand($select_sql);

               $term_data_array = array();
               foreach ($query_result as $query_result_data) {
                  $term = $query_result_data['term'];
                  $word_count = $query_result_data['tf'];
                  $term_data = '{ term_word: "'.addslashes($term).'", word_count: '.$word_count.' }';
                  array_push($term_data_array, $term_data);
               }
               $term_data_array_string = implode(',', $term_data_array);

               if (!empty($term_data_array_string)) {
                  ?>
                  <div id="term_frequency" style="width: 100%; height: 400px;"></div>
                  <script type="text/javascript">
                  var chart_wt;
                  var chartData_wt = [<?=$term_data_array_string?>];

                  AmCharts.ready(function () {
                     // SERIAL CHART
                     chart_wt = new AmCharts.AmSerialChart();
                     chart_wt.dataProvider = chartData_wt;
                     chart_wt.categoryField = "term_word";
                     chart_wt.startDuration = 1;

                     // AXES
                     // category
                     var categoryAxis = chart_wt.categoryAxis;
                     categoryAxis.labelRotation = 90;
                     categoryAxis.gridPosition = "start";
                     categoryAxis.autoGridCount = false;
                     categoryAxis.gridCount = 100000;

                     // value
                     // in case you don't want to change default settings of value axis,
                     // you don't need to create it, as one value axis is created automatically.

                     // GRAPH
                     var graph = new AmCharts.AmGraph();
                     graph.valueField = "word_count";
                     graph.balloonText = "[[category]]: [[value]]";
                     graph.type = "column";
                     graph.lineAlpha = 0;
                     graph.fillAlphas = 0.8;
                     chart_wt.addGraph(graph);

                     chart_wt.write("term_frequency");
                  });
                  </script>
                  <?php
               }
               ?>
            </td>
         </tr>
         <tr>
            <td rowspan="1">TF-IDF</td>
            <td colspan="2" width="800">
               <?php
               $select_sql = "SELECT term,pos,tf,tfidf FROM lyrics_term_tfidf WHERE song_id='".$_GET['song_id']."' AND is_deleted=0 ORDER BY term";
               $query_result = $db_obj->selectCommand($select_sql);

               $term_data_array = array();
               foreach ($query_result as $query_result_data) {
                  $term = $query_result_data['term'];
                  $word_count = round($query_result_data['tfidf'], 4);
                  $term_data = '{ TFIDF: "'.addslashes($term).'", word_count: '.$word_count.' }';
                  array_push($term_data_array, $term_data);
               }
               $term_data_array_string = implode(',', $term_data_array);

               if (!empty($term_data_array_string)) {
                  ?>
                  <div id="tfidf" style="width: 100%; height: 400px;"></div>
                  <script type="text/javascript">
                  var chart_tfidf;
                  var chartData_tfidf = [<?=$term_data_array_string?>];

                  AmCharts.ready(function () {
                     // SERIAL CHART
                     chart_tfidf = new AmCharts.AmSerialChart();
                     chart_tfidf.dataProvider = chartData_tfidf;
                     chart_tfidf.categoryField = "TFIDF";
                     chart_tfidf.startDuration = 1;

                     // AXES
                     // category
                     var categoryAxis = chart_tfidf.categoryAxis;
                     categoryAxis.labelRotation = 90;
                     categoryAxis.gridPosition = "start";
                     categoryAxis.autoGridCount = false;
                     categoryAxis.gridCount = 100000;

                     // value
                     // in case you don't want to change default settings of value axis,
                     // you don't need to create it, as one value axis is created automatically.

                     // GRAPH
                     var graph = new AmCharts.AmGraph();
                     graph.valueField = "word_count";
                     graph.balloonText = "[[category]]: [[value]]";
                     graph.type = "column";
                     graph.lineAlpha = 0;
                     graph.fillAlphas = 0.8;
                     chart_tfidf.addGraph(graph);

                     chart_tfidf.write("tfidf");
                  });
                  </script>
                  <?php
               }
               ?>
            </td>
         </tr>
         <tr>
            <td rowspan="1">LDA Value</td>
            <td colspan="2" width="800">
               <?php
               $db_obj = LMDBAccess::getInstance();
               /*$select_sql = "SELECT new_song_id FROM lyrics_term_tfidf_continue WHERE song_id = ".$_GET['song_id']." GROUP BY new_song_id LIMIT 1";

               $query_result = $db_obj->selectCommand($select_sql);

               foreach ($query_result as $query_result_data) {
                  $lda_new_song_id = $query_result_data['new_song_id'];
               }

               if ($_GET['lda_model']=='tf_lda') {
                  $topic = shell_exec("python26 ".SITE_ROOT."/p-library/model/music_feature/lda_topic.py ".$lda_new_song_id." ".$_GET['lda_model']);
                  ?>
                  <pre>
2012-09-18 00:40:29,687 : INFO : initializing corpus reader from /var/www/html/lyrics-match/p-library/model/music_feature/20120917_lyrics_tf.mm
2012-09-18 00:40:29,687 : INFO : accepted corpus with 913 documents, 12684 features, 60108 non-zero entries
2012-09-18 00:40:29,738 : INFO : topic #0: 0.060*愚笨 + 0.017*冇掂過 + 0.015*惱河 + 0.011*徹底 + 0.011*厲害 + 0.011*亮麗 + 0.010*誤解 + 0.008*超過 + 0.008*不被 + 0.007*邂逅 + 0.007*沒收 + 0.006*真理 + 0.006*卸便 + 0.006*永生 + 0.005*奸黨 + 0.005*眉飛色舞 + 0.005*感激 + 0.005*現代化 + 0.005*赤道 + 0.004*回想起 + 0.004*替身 + 0.004*寂寂寞寞 + 0.004*不肯短痛 + 0.004*時鐘 + 0.004*不易 + 0.004*過冷 + 0.004*手震 + 0.003*商量 + 0.003*不曾 + 0.003*不冀盼 + 0.003*忘掉 + 0.003*世情 + 0.003*俯瞰 + 0.003*放晴 + 0.003*傷害 + 0.003*溫暖 + 0.003*職業 + 0.003*天黑 + 0.003*沏 + 0.003*顯眼 + 0.003*己經 + 0.003*聽聽話話 + 0.003*勇敢 + 0.003*無比 + 0.003*已然 + 0.003*還要 + 0.003*未了 + 0.003*想見 + 0.002*主題歌 + 0.002*不回頭
2012-09-18 00:40:29,745 : INFO : topic #1: 0.020*愚笨 + 0.011*惱河 + 0.007*徹底 + 0.006*沒收 + 0.006*不被 + 0.005*亮麗 + 0.005*冇掂過 + 0.005*幸 + 0.005*厲害 + 0.004*不心痛 + 0.004*愛恨 + 0.004*赤道 + 0.004*交響 + 0.004*木馬 + 0.004*卸便 + 0.004*難度 + 0.004*沏 + 0.004*邂逅 + 0.004*手震 + 0.004*誤解 + 0.004*僅有 + 0.004*替身 + 0.004*眉飛色舞 + 0.003*一概 + 0.003*視野 + 0.003*話風 + 0.003*侶 + 0.003*曹魏 + 0.003*導致 + 0.003*介紹 + 0.003*從來 + 0.003*開張 + 0.003*俯瞰 + 0.002*當兵 + 0.002*世一 + 0.002*情事 + 0.002*奸黨 + 0.002*己經 + 0.002*戀情 + 0.002*職業 + 0.002*真實 + 0.002*玩耍 + 0.002*天生 + 0.002*不答應 + 0.002*沒趣 + 0.002*放過 + 0.002*領會 + 0.002*辦不到 + 0.002*狀況 + 0.002*洶湧
2012-09-18 00:40:29,753 : INFO : topic #2: 0.012*愚笨 + 0.008*待在 + 0.008*惱河 + 0.007*亮麗 + 0.007*沒收 + 0.007*冇掂過 + 0.006*不被 + 0.006*厲害 + 0.005*愛恨 + 0.005*交響 + 0.005*奸黨 + 0.005*手震 + 0.004*商量 + 0.004*誤解 + 0.004*氾濫 + 0.004*刀鋒 + 0.004*木馬 + 0.004*讀 + 0.004*矜貴 + 0.004*沏 + 0.004*徹底 + 0.004*曲終人散 + 0.003*一段 + 0.003*邂逅 + 0.003*己經 + 0.003*替身 + 0.003*吹過 + 0.003*不曾 + 0.003*唯美 + 0.003*兵荒馬亂 + 0.003*應聲 + 0.003*夠多 + 0.003*如今 + 0.003*顏色 + 0.003*詭秘 + 0.003*回音 + 0.003*天黑 + 0.003*回想起 + 0.003*不怎麼 + 0.003*難題 + 0.003*受不住 + 0.003*難過 + 0.003*錨 + 0.003*知足常樂 + 0.003*愛不釋手 + 0.002*歇 + 0.002*哪裡 + 0.002*開墾 + 0.002*按呢 + 0.002*多麼
2012-09-18 00:40:29,759 : INFO : topic #3: 0.021*徹底 + 0.011*亮麗 + 0.011*愚笨 + 0.008*惱河 + 0.008*夠多 + 0.006*天黑 + 0.005*三言兩語 + 0.005*沒收 + 0.005*冇掂過 + 0.005*相依為命 + 0.005*沏 + 0.005*男 + 0.004*最好 + 0.004*如今 + 0.004*還可以 + 0.004*厲害 + 0.004*卸便 + 0.004*愛恨 + 0.004*吹過 + 0.004*顯眼 + 0.004*你們 + 0.004*離歌 + 0.004*情事 + 0.004*永生 + 0.004*誤解 + 0.004*唯美 + 0.003*女 + 0.003*顏色 + 0.003*看顧 + 0.003*人造 + 0.003*甲老 + 0.003*待在 + 0.003*邂逅 + 0.003*替身 + 0.003*存亡 + 0.003*手震 + 0.003*讀 + 0.003*幸 + 0.003*不易 + 0.003*竹林 + 0.003*真理 + 0.003*忘掉 + 0.003*一段 + 0.003*至尊 + 0.003*生根 + 0.003*快慰 + 0.003*靈驗 + 0.003*人物畫面 + 0.003*生動 + 0.002*眉飛色舞
2012-09-18 00:40:29,762 : INFO : topic #4: 0.022*愚笨 + 0.011*冇掂過 + 0.008*木馬 + 0.008*惱河 + 0.007*脫下 + 0.006*天黑 + 0.006*待在 + 0.006*沏 + 0.006*謙卑 + 0.006*為什麼 + 0.006*邂逅 + 0.005*替身 + 0.005*卸便 + 0.005*己經 + 0.005*軀體 + 0.004*曲終人散 + 0.004*赤道 + 0.004*伸手 + 0.004*焉 + 0.004*眉飛色舞 + 0.004*誤解 + 0.004*奸黨 + 0.004*細雨 + 0.004*如今 + 0.004*夠多 + 0.004*不被 + 0.003*徹底 + 0.003*沒收 + 0.003*知足常樂 + 0.003*過冷 + 0.003*各自 + 0.003*厲害 + 0.003*交響 + 0.003*悽慘 + 0.003*大驚小怪 + 0.003*歹逗陣 + 0.003*習不習慣 + 0.003*一諗 + 0.003*亮麗 + 0.003*得分 + 0.003*分憂 + 0.003*你們 + 0.003*偏離 + 0.003*侶 + 0.003*守護神 + 0.003*介紹 + 0.003*痕跡 + 0.003*想當然 + 0.003*設計 + 0.003*企鵝
2012-09-18 00:40:29,765 : INFO : topic #5: 0.011*待在 + 0.009*奸黨 + 0.008*三言兩語 + 0.008*傷害 + 0.007*理會 + 0.007*卸便 + 0.006*開墾 + 0.006*患難 + 0.006*邂逅 + 0.006*惱河 + 0.005*愚笨 + 0.005*裝飾品 + 0.005*眼眸 + 0.004*愛恨 + 0.004*沏 + 0.004*赤道 + 0.004*誤解 + 0.004*眉飛色舞 + 0.004*放鬆 + 0.004*不切實際 + 0.004*沒收 + 0.003*找不出 + 0.003*最好 + 0.003*派遣 + 0.003*徹底 + 0.003*謙卑 + 0.003*怔怔 + 0.003*已然 + 0.003*冇掂過 + 0.003*燐火 + 0.003*苦練 + 0.003*手震 + 0.003*除外 + 0.003*幸 + 0.003*世情 + 0.003*一段 + 0.002*沉靜 + 0.002*顏色 + 0.002*愛河 + 0.002*談論 + 0.002*捨下 + 0.002*思 + 0.002*朗朗 + 0.002*職業 + 0.002*厲害 + 0.002*躍過 + 0.002*記取 + 0.002*跪拜 + 0.002*夠多 + 0.002*內情
2012-09-18 00:40:29,768 : INFO : topic #6: 0.015*眉飛色舞 + 0.013*愚笨 + 0.009*替身 + 0.008*奸黨 + 0.007*惱河 + 0.007*原 + 0.006*誤解 + 0.005*裝飾品 + 0.005*世情 + 0.005*厲害 + 0.005*不切實際 + 0.005*亮麗 + 0.005*夠多 + 0.004*徹底 + 0.004*邂逅 + 0.004*沒收 + 0.004*怔怔 + 0.004*洶湧 + 0.004*突圍 + 0.004*看顧 + 0.004*待在 + 0.004*現代化 + 0.004*冇掂過 + 0.004*職業 + 0.003*卸便 + 0.003*需 + 0.003*那里 + 0.003*夜風 + 0.003*感激 + 0.003*明珠 + 0.003*哪裡 + 0.003*三言兩語 + 0.003*不惜 + 0.003*多麼 + 0.003*不曾 + 0.003*俯瞰 + 0.003*縱洗 + 0.003*過份 + 0.003*木馬 + 0.003*覺察到 + 0.003*不被 + 0.003*僅有 + 0.003*女子 + 0.002*快慰 + 0.002*顯眼 + 0.002*不肯短痛 + 0.002*傷風 + 0.002*談論 + 0.002*不易 + 0.002*得分
2012-09-18 00:40:29,771 : INFO : topic #7: 0.044*愚笨 + 0.011*惱河 + 0.011*誤解 + 0.010*徹底 + 0.009*沒收 + 0.008*眉飛色舞 + 0.008*邂逅 + 0.007*裝飾品 + 0.006*亮麗 + 0.006*愛恨 + 0.005*己經 + 0.005*待在 + 0.005*赤道 + 0.004*寂寂寞寞 + 0.004*冇掂過 + 0.004*僅有 + 0.004*明珠 + 0.004*卸便 + 0.004*所謂 + 0.004*天黑 + 0.004*幸 + 0.004*夠多 + 0.004*哪裡 + 0.004*相依為命 + 0.004*世情 + 0.003*厲害 + 0.003*溫暖 + 0.003*替身 + 0.003*感激 + 0.003*怔怔 + 0.003*呼叫 + 0.003*知足常樂 + 0.003*還好 + 0.003*奸黨 + 0.003*忘掉 + 0.003*木馬 + 0.003*跪拜 + 0.003*不冀盼 + 0.003*不易 + 0.003*真理 + 0.003*手震 + 0.003*等候 + 0.003*代誌 + 0.003*沒有聲 + 0.003*眼框 + 0.003*永生 + 0.002*無比 + 0.002*現代化 + 0.002*矜貴 + 0.002*一段
2012-09-18 00:40:29,774 : INFO : topic #8: 0.010*惱河 + 0.008*悲 + 0.008*用錯 + 0.007*愚笨 + 0.007*沏 + 0.007*冇掂過 + 0.007*邂逅 + 0.006*顯眼 + 0.006*木馬 + 0.006*永生 + 0.005*沒收 + 0.005*痕跡 + 0.005*自用 + 0.005*誤解 + 0.005*多麼 + 0.005*在一起 + 0.004*擁擠 + 0.004*鬢 + 0.004*茫茫 + 0.004*夠多 + 0.004*方可襯 + 0.004*真理 + 0.004*天黑 + 0.003*相隨 + 0.003*帳 + 0.003*地描劃 + 0.003*天秤 + 0.003*無比 + 0.003*替身 + 0.003*三言兩語 + 0.003*不曾 + 0.003*待在 + 0.003*不心痛 + 0.003*總易 + 0.003*交響 + 0.003*你們 + 0.003*謙卑 + 0.003*漫步 + 0.003*知足常樂 + 0.003*厲害 + 0.003*長城 + 0.003*深海 + 0.003*怔怔 + 0.003*明唔 + 0.002*寂寂寞寞 + 0.002*流沙 + 0.002*所謂 + 0.002*流浪漢 + 0.002*入眠 + 0.002*天意
2012-09-18 00:40:29,777 : INFO : topic #9: 0.013*愚笨 + 0.008*徹底 + 0.006*侶 + 0.006*謙卑 + 0.005*誤解 + 0.005*寂寂寞寞 + 0.005*亮麗 + 0.005*惱河 + 0.005*天黑 + 0.005*冇掂過 + 0.004*朗朗 + 0.004*熱烈 + 0.004*裝飾品 + 0.004*替身 + 0.004*抬頭 + 0.003*己經 + 0.003*三言兩語 + 0.003*心眼 + 0.003*不曾 + 0.003*揚起 + 0.003*超過 + 0.003*昨晚 + 0.003*怔怔 + 0.003*懂不懂 + 0.003*後天 + 0.003*沒收 + 0.003*羅 + 0.003*快活 + 0.003*飆 + 0.003*商量 + 0.003*害 + 0.003*一段 + 0.003*時代 + 0.003*明珠 + 0.003*徒勞 + 0.003*彼領 + 0.003*別緻 + 0.003*木馬 + 0.003*畔 + 0.002*從來 + 0.002*竹林 + 0.002*伸手 + 0.002*不切實際 + 0.002*鑽洞 + 0.002*眉飛色舞 + 0.002*最好 + 0.002*難題 + 0.002*靜默 + 0.002*夜行 + 0.002*睜開
2012-09-18 00:40:29,780 : INFO : topic #10: 0.012*永生 + 0.012*愚笨 + 0.010*徹底 + 0.008*離歌 + 0.007*喜新厭舊 + 0.006*成佛 + 0.006*裝飾品 + 0.005*今夜 + 0.005*超過 + 0.005*談論 + 0.005*沏 + 0.005*明唔 + 0.005*顏色 + 0.004*惱河 + 0.004*替身 + 0.004*世情 + 0.004*看緊 + 0.004*六月 + 0.004*誤解 + 0.004*沒收 + 0.004*離難捨 + 0.004*交響 + 0.004*甲老 + 0.004*奮鬥 + 0.004*美酒 + 0.004*還要 + 0.004*慢吞吞 + 0.003*卸便 + 0.003*浩瀚 + 0.003*救命 + 0.003*帳 + 0.003*理 + 0.003*如今 + 0.003*邂逅 + 0.003*上岸 + 0.003*焉 + 0.003*改寫 + 0.003*眉飛色舞 + 0.003*曲終人散 + 0.003*只管 + 0.003*答 + 0.003*終于 + 0.003*己經 + 0.003*僅有 + 0.003*日夜 + 0.003*悽慘 + 0.003*飆 + 0.003*逃跑 + 0.003*遇 + 0.003*木馬
2012-09-18 00:40:29,783 : INFO : topic #11: 0.020*惱河 + 0.008*木馬 + 0.007*厲害 + 0.006*愚笨 + 0.006*怔怔 + 0.006*邂逅 + 0.005*相依為命 + 0.005*沒收 + 0.004*侶 + 0.004*歇 + 0.004*離難捨 + 0.004*冇掂過 + 0.004*怨言 + 0.004*沏 + 0.003*為什麼 + 0.003*淌 + 0.003*誤解 + 0.003*代誌 + 0.003*奸黨 + 0.003*大驚小怪 + 0.003*替身 + 0.003*得分 + 0.003*卸便 + 0.003*亮麗 + 0.003*焉 + 0.003*己經 + 0.002*待在 + 0.002*天黑 + 0.002*狂飲 + 0.002*危難處 + 0.002*不走開 + 0.002*僅有 + 0.002*徹底 + 0.002*一生 + 0.002*縱洗 + 0.002*慢吞吞 + 0.002*忽隱 + 0.002*房間 + 0.002*矜貴 + 0.002*眉飛色舞 + 0.002*最好 + 0.002*職業 + 0.002*仍 + 0.002*旅程 + 0.002*眼眸 + 0.002*赤道 + 0.002*三言兩語 + 0.002*終于 + 0.002*從來 + 0.002*商量
2012-09-18 00:40:29,786 : INFO : topic #12: 0.010*時鐘 + 0.009*眉飛色舞 + 0.009*職業 + 0.009*惱河 + 0.008*所謂 + 0.007*冇掂過 + 0.006*沏 + 0.006*世情 + 0.006*妹 + 0.005*替身 + 0.005*厲害 + 0.005*徒勞 + 0.005*沒收 + 0.004*竹林 + 0.004*能否 + 0.004*徹底 + 0.004*今夜 + 0.004*商量 + 0.003*手震 + 0.003*週到 + 0.003*快慰 + 0.003*不冀盼 + 0.003*特色 + 0.003*俯瞰 + 0.003*默許 + 0.003*己經 + 0.003*天秤 + 0.003*今日 + 0.003*愚笨 + 0.003*離難捨 + 0.003*諸葛亮 + 0.003*為什麼 + 0.003*不被 + 0.003*臃腫 + 0.003*開墾 + 0.003*知足常樂 + 0.003*偏離 + 0.003*亮麗 + 0.002*焉 + 0.002*寂寂寞寞 + 0.002*乞 + 0.002*朗朗 + 0.002*卸便 + 0.002*浪子 + 0.002*還要 + 0.002*邂逅 + 0.002*最好 + 0.002*擁擠 + 0.002*侶 + 0.002*那里
2012-09-18 00:40:29,789 : INFO : topic #13: 0.023*愚笨 + 0.020*惱河 + 0.012*亮麗 + 0.010*徹底 + 0.007*冇掂過 + 0.006*誤解 + 0.006*卸便 + 0.005*一段 + 0.005*赤道 + 0.005*三言兩語 + 0.005*裝飾品 + 0.004*兵荒馬亂 + 0.004*天黑 + 0.004*僅有 + 0.004*命途 + 0.004*哪裡 + 0.004*知足常樂 + 0.004*不惜 + 0.004*待在 + 0.003*己經 + 0.003*領會 + 0.003*侶 + 0.003*顯眼 + 0.003*替身 + 0.003*顏色 + 0.003*多麼 + 0.003*代誌 + 0.003*矜貴 + 0.003*沒收 + 0.003*焉 + 0.003*永生 + 0.003*難題 + 0.003*沏 + 0.003*竹林 + 0.003*伸手 + 0.002*曲終人散 + 0.002*攻擊 + 0.002*錨 + 0.002*淘氣 + 0.002*願不願意 + 0.002*真理 + 0.002*偏離 + 0.002*手震 + 0.002*奸黨 + 0.002*唯美 + 0.002*所謂 + 0.002*止迷倒 + 0.002*應聲 + 0.002*俯瞰 + 0.002*木馬
2012-09-18 00:40:29,793 : INFO : topic #14: 0.019*愚笨 + 0.008*相依為命 + 0.008*邂逅 + 0.007*浪子 + 0.007*亮麗 + 0.006*厲害 + 0.006*徹底 + 0.006*惱河 + 0.006*冇掂過 + 0.006*製片家 + 0.005*不被 + 0.005*永生 + 0.005*談論 + 0.005*你們 + 0.005*離難捨 + 0.004*己經 + 0.004*怔怔 + 0.004*依歸 + 0.004*幸 + 0.004*陰霾 + 0.004*平時 + 0.004*喜新厭舊 + 0.004*乞 + 0.004*卸便 + 0.003*昨晚 + 0.003*誤解 + 0.003*美酒 + 0.003*擁擠 + 0.003*待在 + 0.003*覺察到 + 0.003*愛不釋手 + 0.003*筆跡 + 0.003*將 + 0.003*不曾 + 0.003*合合 + 0.003*沒收 + 0.003*失勢 + 0.003*沏 + 0.003*開墾 + 0.003*算計 + 0.003*三言兩語 + 0.003*兵荒馬亂 + 0.002*還好 + 0.002*交響 + 0.002*天秤 + 0.002*榜樣 + 0.002*若隱若現 + 0.002*不冀盼 + 0.002*瞬息 + 0.002*女
2012-09-18 00:40:29,796 : INFO : topic #15: 0.015*冇掂過 + 0.009*奸黨 + 0.009*徹底 + 0.008*惱河 + 0.008*亮麗 + 0.006*眉飛色舞 + 0.006*交響 + 0.006*悽慘 + 0.005*沒收 + 0.005*厲害 + 0.005*扼殺 + 0.005*誤解 + 0.004*不被 + 0.004*代誌 + 0.004*偏離 + 0.004*顯眼 + 0.004*己經 + 0.004*沏 + 0.004*邂逅 + 0.003*手震 + 0.003*曲終人散 + 0.003*曹魏 + 0.003*看顧 + 0.003*木馬 + 0.003*天黑 + 0.003*焉 + 0.003*不惜 + 0.003*赤道 + 0.003*夠多 + 0.003*原 + 0.003*筆跡 + 0.003*介紹 + 0.003*忠貞 + 0.003*僅有 + 0.003*六月 + 0.003*為什麼 + 0.003*俯瞰 + 0.003*知足常樂 + 0.003*多麼 + 0.003*喜氣 + 0.003*愚笨 + 0.003*怔怔 + 0.002*待在 + 0.002*時代 + 0.002*痕跡 + 0.002*已然 + 0.002*三言兩語 + 0.002*天秤 + 0.002*彼時 + 0.002*吹過
2012-09-18 00:40:29,799 : INFO : topic #16: 0.017*愚笨 + 0.014*徹底 + 0.010*奸黨 + 0.007*亮麗 + 0.007*誤解 + 0.007*冇掂過 + 0.006*快慰 + 0.006*沒收 + 0.006*手震 + 0.005*木馬 + 0.005*邂逅 + 0.005*曲終人散 + 0.005*惱河 + 0.005*沏 + 0.004*交響 + 0.004*眉飛色舞 + 0.004*裝飾品 + 0.004*替身 + 0.004*己經 + 0.003*伸手 + 0.003*介紹 + 0.003*世情 + 0.003*一段 + 0.003*厲害 + 0.003*不被 + 0.003*幸 + 0.003*哪裡 + 0.003*商量 + 0.003*偏離 + 0.003*待在 + 0.003*卸便 + 0.003*夢魘 + 0.003*吹過 + 0.003*筆跡 + 0.003*所謂 + 0.003*繭 + 0.002*曹魏 + 0.002*天秤 + 0.002*多麼 + 0.002*超過 + 0.002*最好 + 0.002*離難捨 + 0.002*溜冰 + 0.002*顯眼 + 0.002*不怎麼 + 0.002*痕跡 + 0.002*不心痛 + 0.002*縱洗 + 0.002*大驚小怪 + 0.002*愛恨
2012-09-18 00:40:29,802 : INFO : topic #17: 0.009*亮麗 + 0.007*沒收 + 0.007*奸黨 + 0.007*徹底 + 0.006*替身 + 0.006*厲害 + 0.005*愛恨 + 0.005*待在 + 0.005*哪裡 + 0.005*刮起 + 0.005*愚笨 + 0.005*不被 + 0.004*感激 + 0.004*冇掂過 + 0.004*天黑 + 0.004*眼框 + 0.004*財物 + 0.004*焉 + 0.004*乞 + 0.004*知足常樂 + 0.004*沏 + 0.004*慢吞吞 + 0.004*手震 + 0.003*顯眼 + 0.003*得分 + 0.003*己經 + 0.003*裝飾品 + 0.003*赤道 + 0.003*木馬 + 0.003*眉飛色舞 + 0.003*談論 + 0.003*所謂 + 0.003*惱河 + 0.003*體驗 + 0.003*世情 + 0.003*說說話 + 0.003*誤解 + 0.003*能否 + 0.003*不冀盼 + 0.003*明日 + 0.003*快慰 + 0.003*離歌 + 0.003*想見 + 0.002*忠貞 + 0.002*在一起 + 0.002*戀情 + 0.002*三言兩語 + 0.002*竹林 + 0.002*相思樹 + 0.002*幸
2012-09-18 00:40:29,805 : INFO : topic #18: 0.008*愚笨 + 0.008*徹底 + 0.007*世情 + 0.007*沏 + 0.007*亮麗 + 0.007*邂逅 + 0.006*天黑 + 0.006*手震 + 0.006*玖零年代 + 0.006*替身 + 0.006*冇掂過 + 0.006*誤解 + 0.004*美酒 + 0.004*裝飾品 + 0.004*明唔 + 0.004*赤道 + 0.004*木馬 + 0.004*偏離 + 0.004*交響 + 0.004*大驚小怪 + 0.004*羅 + 0.004*不多 + 0.003*永生 + 0.003*沒收 + 0.003*只管 + 0.003*擁吻 + 0.003*等候 + 0.003*期 + 0.003*關顧 + 0.003*惱河 + 0.003*黐身 + 0.003*介紹 + 0.003*哪日 + 0.003*多麼 + 0.003*想當然 + 0.003*洶湧 + 0.003*俠客 + 0.003*多餘 + 0.003*一諗 + 0.003*生動 + 0.003*時代 + 0.003*回想起 + 0.002*身過 + 0.002*愛恨 + 0.002*顯眼 + 0.002*厲害 + 0.002*怨言 + 0.002*繭 + 0.002*捫心自問 + 0.002*代誌
2012-09-18 00:40:29,808 : INFO : topic #19: 0.020*愚笨 + 0.019*誤解 + 0.016*冇掂過 + 0.012*徹底 + 0.012*惱河 + 0.009*天黑 + 0.009*奮鬥 + 0.008*沒收 + 0.008*亮麗 + 0.008*甲老 + 0.007*夠多 + 0.007*厲害 + 0.007*知足常樂 + 0.007*奸黨 + 0.007*邂逅 + 0.006*卸便 + 0.006*赤道 + 0.006*悽慘 + 0.006*今夜 + 0.005*不被 + 0.005*錨 + 0.005*己經 + 0.005*不曾 + 0.004*各自 + 0.004*告解 + 0.004*志願 + 0.004*未了 + 0.004*孤兒仔 + 0.004*僅有 + 0.004*裝飾品 + 0.003*從來 + 0.003*天份 + 0.003*木馬 + 0.003*俯瞰 + 0.003*沏 + 0.003*世情 + 0.003*一段 + 0.003*讀 + 0.003*已然 + 0.003*筆跡 + 0.003*時代 + 0.003*曹魏 + 0.003*明唔 + 0.003*身過 + 0.003*分憂 + 0.003*不易 + 0.003*永生 + 0.003*昨晚 + 0.003*焉 + 0.003*不肯短痛
                  </pre>
                  <?php
                  echo nl2br($topic);
               } else {
                  $topic = shell_exec("python26 ".SITE_ROOT."/p-library/model/music_feature/lda_topic.py ".$lda_new_song_id." ".$_GET['lda_model']);
                  ?>
                  <pre>
2012-09-18 00:38:56,976 : INFO : initializing corpus reader from /var/www/html/lyrics-match/p-library/model/music_feature/20120917_lyrics_tfidf.mm
2012-09-18 00:38:56,976 : INFO : accepted corpus with 913 documents, 12684 features, 60108 non-zero entries
2012-09-18 00:38:57,034 : INFO : topic #0: 0.005*命途 + 0.003*冇掂過 + 0.003*超過 + 0.003*沏 + 0.003*徹底 + 0.003*惱河 + 0.003*邂逅 + 0.003*己經 + 0.003*歲數 + 0.003*愚笨 + 0.003*介紹 + 0.003*不走開 + 0.002*稻穗 + 0.002*內情 + 0.002*俠客 + 0.002*三言兩語 + 0.002*錨 + 0.002*顛倒 + 0.002*示好 + 0.002*一段 + 0.002*幸 + 0.002*誤解 + 0.002*多麼 + 0.002*離場 + 0.002*恐 + 0.002*趣 + 0.002*守信 + 0.002*抬頭 + 0.002*兵荒馬亂 + 0.002*身過 + 0.002*未曾 + 0.002*最好 + 0.002*理 + 0.002*替身 + 0.002*厲害 + 0.002*不快 + 0.002*曹魏 + 0.002*壓軸 + 0.002*曬傷 + 0.002*逃跑 + 0.002*生根 + 0.002*捨得 + 0.002*從來 + 0.002*相親相愛 + 0.002*心軟 + 0.002*做主 + 0.002*多餘 + 0.002*碰 + 0.002*羅 + 0.002*忽隱
2012-09-18 00:38:57,037 : INFO : topic #1: 0.015*甲老 + 0.015*奮鬥 + 0.007*用錯 + 0.006*各自 + 0.005*奸黨 + 0.003*孤兒仔 + 0.003*天黑 + 0.003*矜貴 + 0.003*離歌 + 0.003*亮麗 + 0.003*知足常樂 + 0.003*代誌 + 0.003*木馬 + 0.003*沒有聲 + 0.003*一段 + 0.003*黐身 + 0.003*悽慘 + 0.002*揭開 + 0.002*冇掂過 + 0.002*多麼 + 0.002*厲害 + 0.002*擇日 + 0.002*交響 + 0.002*刀鋒 + 0.002*隨手 + 0.002*不叫 + 0.002*徹底 + 0.002*不確定 + 0.002*卸便 + 0.002*離難捨 + 0.002*得分 + 0.002*心急 + 0.002*愚笨 + 0.002*沒收 + 0.002*敢死隊 + 0.002*你們 + 0.002*更換 + 0.002*趕 + 0.002*痴 + 0.002*從不 + 0.002*既是 + 0.002*所謂 + 0.002*曹魏 + 0.002*跪拜 + 0.002*赤道 + 0.002*取捨 + 0.002*遠離 + 0.002*橋段 + 0.002*大驚小怪 + 0.002*跳陣舞
2012-09-18 00:38:57,040 : INFO : topic #2: 0.004*理會 + 0.003*傷害 + 0.003*情事 + 0.003*妹 + 0.003*談論 + 0.003*唯美 + 0.003*乳果 + 0.003*怔怔 + 0.003*相依為命 + 0.003*酸苦 + 0.002*冇掂過 + 0.002*好運 + 0.002*己經 + 0.002*歇 + 0.002*惱河 + 0.002*卸便 + 0.002*繭 + 0.002*竹林 + 0.002*愚笨 + 0.002*失勢 + 0.002*木馬 + 0.002*徹底 + 0.002*念到 + 0.002*亮麗 + 0.002*奸黨 + 0.002*迷霧 + 0.002*飆 + 0.002*手震 + 0.002*筋 + 0.002*一段 + 0.002*帳 + 0.002*替身 + 0.002*算計 + 0.002*明珠 + 0.002*曹魏 + 0.002*乞 + 0.002*最好 + 0.002*代誌 + 0.002*誤解 + 0.002*沒收 + 0.002*你們 + 0.002*親愛的 + 0.002*赤道 + 0.002*放鬆 + 0.002*靜默 + 0.002*為什麼 + 0.002*昨晚 + 0.002*任風 + 0.002*不惜 + 0.002*認認真真
2012-09-18 00:38:57,043 : INFO : topic #3: 0.004*願不願意 + 0.004*亮麗 + 0.004*誤解 + 0.004*惱河 + 0.004*難度 + 0.004*沒收 + 0.004*消失 + 0.003*永生 + 0.003*替身 + 0.003*練拳 + 0.003*擁擠 + 0.003*不多 + 0.003*木馬 + 0.003*帳 + 0.003*愚笨 + 0.003*厲害 + 0.003*痛心 + 0.003*突圍 + 0.003*奸黨 + 0.003*真理 + 0.003*溫暖 + 0.002*世情 + 0.002*聽聽話話 + 0.002*喜新厭舊 + 0.002*死 + 0.002*領會 + 0.002*回想起 + 0.002*為 + 0.002*在野 + 0.002*待在 + 0.002*赤道 + 0.002*昨晚 + 0.002*除外 + 0.002*卸便 + 0.002*雨點 + 0.002*哪裡 + 0.002*在一起 + 0.002*怔怔 + 0.002*愛恨 + 0.002*不被 + 0.002*知足常樂 + 0.002*沒趣 + 0.002*大驚小怪 + 0.002*時代 + 0.002*續集 + 0.002*有望 + 0.002*捨去 + 0.002*不冀盼 + 0.002*關上 + 0.002*夠多
2012-09-18 00:38:57,047 : INFO : topic #4: 0.003*週到 + 0.003*下午 + 0.003*黃臉婆 + 0.002*夢迴 + 0.002*冇掂過 + 0.002*盡量 + 0.002*燐火 + 0.002*明日 + 0.002*不冀盼 + 0.002*天秤 + 0.002*惱河 + 0.002*厲害 + 0.002*沏 + 0.002*怨言 + 0.002*遮雨 + 0.002*不走開 + 0.002*猛 + 0.002*難題 + 0.002*介紹 + 0.002*木馬 + 0.002*愛河 + 0.002*亮麗 + 0.002*己經 + 0.002*奸黨 + 0.002*月 + 0.002*沒收 + 0.002*六月 + 0.002*說開 + 0.002*綜合 + 0.002*無量 + 0.002*有心人 + 0.002*迷霧 + 0.002*焉 + 0.002*開墾 + 0.002*回冬 + 0.002*派遣 + 0.002*一段 + 0.002*邂逅 + 0.002*超過 + 0.002*縱洗 + 0.002*自用 + 0.002*傷害 + 0.002*淚如雨下 + 0.002*女 + 0.002*相隨 + 0.002*曲終人散 + 0.002*今夜 + 0.002*愚笨 + 0.002*遞減 + 0.002*趕出
2012-09-18 00:38:57,050 : INFO : topic #5: 0.006*軀體 + 0.005*愚笨 + 0.004*超過 + 0.004*過冷 + 0.004*惱河 + 0.004*麻木 + 0.003*沒收 + 0.003*守護神 + 0.003*亮麗 + 0.003*愛恨 + 0.003*不被 + 0.003*風光 + 0.003*徹底 + 0.003*替身 + 0.003*設計 + 0.003*誤解 + 0.003*主題歌 + 0.003*多麼 + 0.003*天黑 + 0.003*各自 + 0.003*軍 + 0.003*袖 + 0.003*冇掂過 + 0.003*邂逅 + 0.002*面容 + 0.002*厲害 + 0.002*債 + 0.002*顯眼 + 0.002*溫文 + 0.002*勇敢 + 0.002*不曾 + 0.002*有點 + 0.002*慢吞吞 + 0.002*手震 + 0.002*哭成 + 0.002*為什麼 + 0.002*時代 + 0.002*已然 + 0.002*不冀盼 + 0.002*作證 + 0.002*不易 + 0.002*縱洗 + 0.002*俯瞰 + 0.002*下午 + 0.002*仲夏 + 0.002*自用 + 0.002*乞 + 0.002*待在 + 0.002*卸便 + 0.002*相連
2012-09-18 00:38:57,053 : INFO : topic #6: 0.005*妹 + 0.004*關顧 + 0.004*鬢 + 0.003*今夜 + 0.003*製片家 + 0.003*相依為命 + 0.003*浪子 + 0.003*慢吞吞 + 0.003*亮麗 + 0.003*惱河 + 0.003*纖纖 + 0.003*木馬 + 0.002*讀 + 0.002*應聲 + 0.002*快慰 + 0.002*園遊會 + 0.002*替身 + 0.002*愚笨 + 0.002*地球人 + 0.002*變心 + 0.002*冇掂過 + 0.002*厲害 + 0.002*已然 + 0.002*平時 + 0.002*沏 + 0.002*職業 + 0.002*吹向 + 0.002*上帝 + 0.002*徹底 + 0.002*生於 + 0.002*喜惡 + 0.002*眼框 + 0.002*箸 + 0.002*夜風 + 0.002*不便 + 0.002*還好 + 0.002*離難捨 + 0.002*美酒 + 0.002*昨晚 + 0.002*討 + 0.002*永生 + 0.002*侶 + 0.002*路障 + 0.002*邂逅 + 0.002*瞬息 + 0.002*學學 + 0.002*待在 + 0.002*行 + 0.002*眉飛色舞 + 0.002*耍賴
2012-09-18 00:38:57,056 : INFO : topic #7: 0.004*愚笨 + 0.004*惱河 + 0.004*忠貞 + 0.004*按呢 + 0.003*夠多 + 0.003*俯瞰 + 0.003*童稚 + 0.003*冇掂過 + 0.003*亮麗 + 0.003*奸黨 + 0.003*永生 + 0.003*錨 + 0.003*知 + 0.003*不被 + 0.003*瘋 + 0.003*赤道 + 0.003*你們 + 0.003*現代化 + 0.002*愛恨 + 0.002*誤解 + 0.002*哪裡 + 0.002*知足常樂 + 0.002*學生 + 0.002*裝飾品 + 0.002*不敗 + 0.002*時代 + 0.002*手震 + 0.002*水星 + 0.002*待在 + 0.002*相依為命 + 0.002*徹底 + 0.002*邂逅 + 0.002*回不了 + 0.002*情事 + 0.002*謙卑 + 0.002*幸 + 0.002*玖零年代 + 0.002*眉飛色舞 + 0.002*不明不白 + 0.002*感觸 + 0.002*替身 + 0.002*明珠 + 0.002*筆跡 + 0.002*偏離 + 0.002*木馬 + 0.002*天秤 + 0.002*原素 + 0.002*詭秘 + 0.002*一概 + 0.002*那里
2012-09-18 00:38:57,059 : INFO : topic #8: 0.004*不害怕 + 0.004*錯事 + 0.003*渲洩 + 0.003*錨 + 0.003*姆指 + 0.003*不回頭 + 0.003*不怎麼 + 0.003*危難處 + 0.003*不須要 + 0.003*洗淨 + 0.003*怔怔 + 0.003*等候 + 0.003*任滿 + 0.003*快慰 + 0.003*愚笨 + 0.003*爸爸 + 0.003*感激 + 0.003*心力交瘁 + 0.002*厲害 + 0.002*旅程 + 0.002*到站 + 0.002*徹底 + 0.002*需 + 0.002*超過 + 0.002*惱河 + 0.002*如今 + 0.002*試練 + 0.002*奸黨 + 0.002*顯眼 + 0.002*沒收 + 0.002*真理 + 0.002*出頭 + 0.002*清晰 + 0.002*交響 + 0.002*冇掂過 + 0.002*眉飛色舞 + 0.002*眼眸 + 0.002*時代 + 0.002*誤解 + 0.002*朗朗 + 0.002*記載 + 0.002*感情用事 + 0.002*回不了 + 0.002*木馬 + 0.002*咬住 + 0.002*邂逅 + 0.002*難題 + 0.002*悲 + 0.002*絕地 + 0.002*愛
2012-09-18 00:38:57,062 : INFO : topic #9: 0.005*愚笨 + 0.004*乖 + 0.004*齊齊 + 0.003*沒收 + 0.003*呦哼 + 0.003*不易 + 0.003*勇敢 + 0.003*感激 + 0.003*村莊 + 0.003*斬首 + 0.003*小子 + 0.003*明唔 + 0.003*救命 + 0.003*能耐 + 0.003*厲害 + 0.003*僅有 + 0.003*餓 + 0.003*真理 + 0.003*牛郎 + 0.003*誤解 + 0.003*不被 + 0.003*冇掂過 + 0.002*瀟瀟灑灑 + 0.002*未了 + 0.002*上岸 + 0.002*不怎麼 + 0.002*己經 + 0.002*天黑 + 0.002*裝飾品 + 0.002*昨夜 + 0.002*美酒 + 0.002*手震 + 0.002*痕跡 + 0.002*侶 + 0.002*日夜 + 0.002*領域 + 0.002*抬頭 + 0.002*徹底 + 0.002*惱河 + 0.002*需 + 0.002*忘掉 + 0.002*終于 + 0.002*原 + 0.002*偏離 + 0.002*奸黨 + 0.002*正經八百 + 0.002*氣結 + 0.002*前進 + 0.002*亮麗 + 0.002*寂寂寞寞
2012-09-18 00:38:57,065 : INFO : topic #10: 0.004*陰霾 + 0.004*遙遙 + 0.004*安好 + 0.004*在一起 + 0.004*原 + 0.003*悽慘 + 0.003*榜樣 + 0.003*時光 + 0.003*流浪漢 + 0.003*逛逛 + 0.003*相依為命 + 0.003*合合 + 0.003*己經 + 0.003*依歸 + 0.003*謝絕 + 0.003*我人 + 0.003*身驕肉貴 + 0.003*完 + 0.003*來自 + 0.003*生動 + 0.003*朗朗 + 0.003*愚笨 + 0.003*彼時 + 0.003*交響 + 0.002*喜悅 + 0.002*冇掂過 + 0.002*哪日 + 0.002*差錯 + 0.002*掛住 + 0.002*痛罵 + 0.002*還可以 + 0.002*開張 + 0.002*踏 + 0.002*始 + 0.002*若隱若現 + 0.002*飆 + 0.002*徹底 + 0.002*惱河 + 0.002*焉 + 0.002*不肯短痛 + 0.002*誤解 + 0.002*不曾 + 0.002*扼殺 + 0.002*手震 + 0.002*停頓 + 0.002*不可 + 0.002*一諗 + 0.002*洶湧 + 0.002*你們 + 0.002*如一
2012-09-18 00:38:57,068 : INFO : topic #11: 0.004*茫茫 + 0.003*不被 + 0.003*悲 + 0.003*誤解 + 0.003*徹底 + 0.002*說說話 + 0.002*無比 + 0.002*冇掂過 + 0.002*總易 + 0.002*曲終人散 + 0.002*不惜 + 0.002*愚笨 + 0.002*哪裡 + 0.002*不肯短痛 + 0.002*天黑 + 0.002*慢吞吞 + 0.002*伸手 + 0.002*騎 + 0.002*風頭 + 0.002*卸便 + 0.002*亮麗 + 0.002*容或 + 0.002*裝飾品 + 0.002*長城 + 0.002*一諗 + 0.002*分憂 + 0.002*永生 + 0.002*偏 + 0.002*起起落落 + 0.002*不退潮 + 0.002*長島 + 0.002*不見怪 + 0.002*吹過 + 0.002*惱河 + 0.002*流浪漢 + 0.002*不曾 + 0.002*沒收 + 0.002*眺望 + 0.002*美 + 0.002*男 + 0.002*交響 + 0.002*待在 + 0.002*如今 + 0.002*己經 + 0.002*望相 + 0.002*後果 + 0.002*悽慘 + 0.002*不知 + 0.002*邂逅 + 0.002*錨
2012-09-18 00:38:57,072 : INFO : topic #12: 0.004*邂逅 + 0.004*天份 + 0.004*依舊 + 0.003*世情 + 0.003*玖零年代 + 0.003*兇鈴 + 0.003*手震 + 0.003*好比 + 0.003*但見 + 0.003*洶湧 + 0.003*快慰 + 0.002*分憂 + 0.002*愚笨 + 0.002*乞 + 0.002*眉飛色舞 + 0.002*怔怔 + 0.002*離難捨 + 0.002*待在 + 0.002*錨 + 0.002*可嘉 + 0.002*交響 + 0.002*鍵 + 0.002*天意 + 0.002*各自 + 0.002*天地 + 0.002*氾濫 + 0.002*牽扯 + 0.002*沏 + 0.002*離歌 + 0.002*一概 + 0.002*誤解 + 0.002*無味 + 0.002*現代化 + 0.002*這會 + 0.002*水星 + 0.002*戲院 + 0.002*縱洗 + 0.002*夠多 + 0.002*奸黨 + 0.002*記取 + 0.002*六月 + 0.002*不惜 + 0.002*僅有 + 0.002*剝落 + 0.002*得分 + 0.002*情人 + 0.002*鐘頭 + 0.002*感激 + 0.002*扼殺 + 0.002*沒收
2012-09-18 00:38:57,075 : INFO : topic #13: 0.004*顯眼 + 0.004*痕跡 + 0.003*永生 + 0.003*即 + 0.003*夠多 + 0.003*裝飾品 + 0.003*冇掂過 + 0.003*不心痛 + 0.003*愚笨 + 0.003*男歡女愛 + 0.003*沖走 + 0.003*芬芳 + 0.003*原 + 0.003*替身 + 0.003*志願 + 0.003*傷風 + 0.003*胸 + 0.003*奸黨 + 0.002*愛恨 + 0.002*主意 + 0.002*燒過 + 0.002*蝴蝶 + 0.002*哪裡 + 0.002*一諗 + 0.002*誤解 + 0.002*自用 + 0.002*漫舞 + 0.002*穿起 + 0.002*信心 + 0.002*想見 + 0.002*答 + 0.002*真理 + 0.002*徹底 + 0.002*天秤 + 0.002*黑壓壓 + 0.002*過人 + 0.002*悽慘 + 0.002*竹林 + 0.002*迷霧 + 0.002*紮 + 0.002*冷冰冰 + 0.002*職業 + 0.002*待在 + 0.002*凍 + 0.002*衝開 + 0.002*一觸即發 + 0.002*美味 + 0.002*三言兩語 + 0.002*忍 + 0.002*看緊
2012-09-18 00:38:57,078 : INFO : topic #14: 0.007*淌 + 0.005*企鵝 + 0.004*緊握 + 0.004*職業 + 0.003*攤位 + 0.003*難題 + 0.003*逼 + 0.003*歹逗陣 + 0.003*快活 + 0.003*形狀 + 0.003*魔術師 + 0.003*黑髮 + 0.003*眉飛色舞 + 0.003*浩瀚 + 0.003*愚笨 + 0.003*裝飾品 + 0.002*費盡 + 0.002*咆哮 + 0.002*一團和氣 + 0.002*奸黨 + 0.002*洶湧 + 0.002*惱河 + 0.002*不切實際 + 0.002*誤解 + 0.002*房間 + 0.002*後天 + 0.002*聲調 + 0.002*愁顏 + 0.002*世情 + 0.002*體驗 + 0.002*相依為命 + 0.002*公理 + 0.002*決堤 + 0.002*徹底 + 0.002*傷痕 + 0.002*睡覺 + 0.002*美女 + 0.002*一生 + 0.002*潦草 + 0.002*驕 + 0.002*邂逅 + 0.002*揚起 + 0.002*潮漲聲 + 0.002*新貴 + 0.002*跪拜 + 0.002*在 + 0.002*眼眸 + 0.002*難過 + 0.002*記取 + 0.002*冇掂過
2012-09-18 00:38:57,081 : INFO : topic #15: 0.009*溜冰 + 0.006*一咧 + 0.005*待在 + 0.005*受不住 + 0.004*愚笨 + 0.004*歇 + 0.004*深潭 + 0.003*亮麗 + 0.003*縱洗 + 0.003*埋首 + 0.003*惱河 + 0.003*背包 + 0.003*諸葛亮 + 0.003*黃黃 + 0.003*從來 + 0.002*天黑 + 0.002*還要 + 0.002*侶 + 0.002*雨夜 + 0.002*誤解 + 0.002*奸黨 + 0.002*木馬 + 0.002*燦爛處 + 0.002*先生 + 0.002*替身 + 0.002*交響 + 0.002*快慰 + 0.002*梁 + 0.002*彎 + 0.002*使得 + 0.002*庭園 + 0.002*香水 + 0.002*無謂 + 0.002*字句 + 0.002*毒蛇 + 0.002*電冰箱 + 0.002*謙卑 + 0.002*冇掂過 + 0.002*商量 + 0.002*幸 + 0.002*志願 + 0.002*邂逅 + 0.002*小學 + 0.002*珍藏 + 0.002*付託 + 0.002*三言兩語 + 0.002*仍 + 0.002*徹底 + 0.002*庇護 + 0.002*記恨
2012-09-18 00:38:57,084 : INFO : topic #16: 0.008*脫下 + 0.005*愚笨 + 0.005*成佛 + 0.004*回想起 + 0.004*志願 + 0.004*時鐘 + 0.004*徹底 + 0.003*最後 + 0.003*夠多 + 0.003*邂逅 + 0.003*想當然 + 0.003*物色 + 0.003*慢吞吞 + 0.003*不被 + 0.003*赤道 + 0.003*卸便 + 0.003*不愉快 + 0.003*放慢 + 0.003*明唔 + 0.003*寂寂寞寞 + 0.003*脣膏 + 0.003*馬戲 + 0.003*沏 + 0.003*分憂 + 0.003*手震 + 0.003*惱河 + 0.003*誤解 + 0.002*厲害 + 0.002*愛恨 + 0.002*知足常樂 + 0.002*除外 + 0.002*越過 + 0.002*一樣 + 0.002*天黑 + 0.002*從來 + 0.002*俯瞰 + 0.002*不肯短痛 + 0.002*交瘁 + 0.002*詞 + 0.002*沒收 + 0.002*承接 + 0.002*亮麗 + 0.002*擁擠 + 0.002*想見 + 0.002*失真 + 0.002*時代 + 0.002*想得開 + 0.002*乞 + 0.002*越 + 0.002*商量
2012-09-18 00:38:57,087 : INFO : topic #17: 0.005*周末 + 0.004*屋簷 + 0.004*狂飲 + 0.004*唯美 + 0.003*替身 + 0.003*徹底 + 0.003*無暇 + 0.003*吹過 + 0.003*沏 + 0.003*怔怔 + 0.002*晚霞 + 0.002*三言兩語 + 0.002*亮麗 + 0.002*愚笨 + 0.002*沒法子 + 0.002*快點 + 0.002*惱河 + 0.002*歇 + 0.002*生火 + 0.002*感激 + 0.002*超過 + 0.002*天大 + 0.002*麥克風 + 0.002*西洋片 + 0.002*朗朗 + 0.002*這邊 + 0.002*記認 + 0.002*爾 + 0.002*厲害 + 0.002*明唔 + 0.002*凹 + 0.002*己經 + 0.002*沒收 + 0.002*繭 + 0.002*帳 + 0.002*開墾 + 0.002*愛不釋手 + 0.002*還要 + 0.002*怎會 + 0.002*欠缺 + 0.002*手震 + 0.002*身過 + 0.002*想入非非 + 0.002*洶湧 + 0.002*張開 + 0.002*強 + 0.002*款式 + 0.002*男男女女 + 0.002*眉飛色舞 + 0.002*關顧
2012-09-18 00:38:57,090 : INFO : topic #18: 0.006*患難 + 0.005*眉飛色舞 + 0.005*過份 + 0.004*女子 + 0.004*媽 + 0.003*方可襯 + 0.003*火星 + 0.003*封閉 + 0.003*寂寂寞寞 + 0.003*焉 + 0.003*賣弄 + 0.003*那會 + 0.003*看顧 + 0.002*愚笨 + 0.002*昨晚 + 0.002*流沙 + 0.002*犧牲品 + 0.002*猛 + 0.002*存亡 + 0.002*不說話 + 0.002*何時 + 0.002*自閉 + 0.002*自用 + 0.002*誤解 + 0.002*翅 + 0.002*男子漢 + 0.002*惱河 + 0.002*無味 + 0.002*沒收 + 0.002*閃 + 0.002*看破 + 0.002*痕跡 + 0.002*所謂 + 0.002*扎鏡花 + 0.002*奇幻 + 0.002*台詞 + 0.002*不被 + 0.002*奸黨 + 0.002*地描劃 + 0.002*夠多 + 0.002*三言兩語 + 0.002*冇掂過 + 0.002*沏 + 0.002*明唔 + 0.002*何妨 + 0.002*忠貞 + 0.002*一諗 + 0.002*看出 + 0.002*布公仔 + 0.002*負
2012-09-18 00:38:57,093 : INFO : topic #19: 0.008*財物 + 0.005*熱烈 + 0.005*刮起 + 0.004*筆跡 + 0.003*喜新厭舊 + 0.003*告解 + 0.003*財神 + 0.003*職業 + 0.003*破損 + 0.003*徹底 + 0.003*悽慘 + 0.003*思 + 0.003*奸黨 + 0.002*發燒 + 0.002*動容 + 0.002*冶艷 + 0.002*永生 + 0.002*亮麗 + 0.002*在野 + 0.002*竭聲嘶 + 0.002*小黑 + 0.002*昨晚 + 0.002*糾結 + 0.002*曹魏 + 0.002*梟雄 + 0.002*現代 + 0.002*焉 + 0.002*關顧 + 0.002*臃腫 + 0.002*前行 + 0.002*夠多 + 0.002*害怕 + 0.002*木馬 + 0.002*顯眼 + 0.002*黃黃 + 0.002*一千世紀 + 0.002*真是 + 0.002*抽煙 + 0.002*行駛 + 0.002*謙卑 + 0.002*煥發 + 0.002*顏色 + 0.002*翅膀 + 0.002*北京 + 0.002*事過境遷 + 0.002*冇掂過 + 0.002*債 + 0.002*最好 + 0.002*心頭 + 0.002*世情
                  </pre>
                  <?php
                  echo nl2br($topic);
               }*/

               ?>
            </td>
         </tr>
      </tbody>
   </table>
   <hr />
   <h2>
      相似歌詞
   </h2>
   <table class="table table-bordered table-striped">
        <thead>
           <tr>
              <th>
               排名
              </th>
              <th>
               song_id
              </th>
              <th>
               藝人
              </th>
              <th>
               歌名
              </th>
              <th>
               相似度
              </th>
           </tr>
        </thead>
        <tbody>
        <?php



         if (isset($_GET['lda_model']) && !empty($_GET['lda_model'])) {

            if ($_GET['lda_model']=='tf_lda') {
               $similar_lyrics = shell_exec("python26 ".SITE_ROOT."/p-library/model/music_feature/similar_lyrics_model_tf_lda.py ".$_GET['song_id']." ");
            } else if ($_GET['lda_model']=='lsi') {
               $similar_lyrics = shell_exec("python26 ".SITE_ROOT."/p-library/model/music_feature/similar_lyrics_model_lsa.py ".$_GET['song_id']." ");
            } else {
               $similar_lyrics = shell_exec("python26 ".SITE_ROOT."/p-library/model/music_feature/similar_lyrics_model_lda.py ".$_GET['song_id']." ");
            }
            //echo $similar_lyrics;
            $similar_lyrics_array = explode(",", $similar_lyrics);
            $rank = 0;
            foreach ($similar_lyrics_array as $skey => $svalue) {
               $rank++;
               $similar_song_value_array = explode(":", $svalue);
               $new_song_id = $similar_song_value_array[0];

               if ($_GET['lda_model']=='lsi') {
                  $select_sql = "SELECT song_id FROM lyrics_term_tfidf_continue_ch WHERE new_song_id = $new_song_id GROUP BY song_id LIMIT 1";
               } else {
                  $select_sql = "SELECT song_id FROM lyrics_term_tfidf_continue WHERE new_song_id = $new_song_id GROUP BY song_id LIMIT 1";
               }

               $query_result = $db_obj->selectCommand($select_sql);

               foreach ($query_result as $query_result_data) {

                  $song_id = $query_result_data['song_id'];
                  $similar_song_obj = new LMSong($song_id);
                  $artist_obj = new LMPerformer($similar_song_obj->performer_id);
                  ?>
                    <tr>
                       <td>
                       <?php echo $rank; ?>
                       </td>
                       <td>
                          <a href="<?=SITE_HOST?>/music/song/index.php?song_id=<?=$similar_song_obj->getId()?>">
                             <?php echo $similar_song_obj->getId(); ?>
                          </a>
                       </td>
                       <td>
                          <?php echo $artist_obj->name; ?>
                       </td>
                       <td>
                          <a href="<?=SITE_HOST?>/music/song/index.php?song_id=<?=$similar_song_obj->getId()?>">
                             <?php echo $similar_song_obj->title; ?>
                          </a>
                       </td>
                       <td>
                          <?php echo $similar_song_value_array[1]; ?>
                       </td>
                    </tr>
                    <?php

                  unset($similar_song_obj);
                  unset($artist_obj);
               }

            }

         } else {

            $select_sql = "SELECT similar_song_id,similar FROM similar_song WHERE song_id='".$_GET['song_id']."' AND model='lyrics-model-".$lmodel_id.".txt' ORDER BY similar DESC";

            $query_result = $db_obj->selectCommand($select_sql);

            $rank = 0;
            foreach ($query_result as $query_result_data) {
               $rank++;
               $similar_song_id = $query_result_data['similar_song_id'];
               $similar = $query_result_data['similar'];

               $similar_song_obj = new LMSong($similar_song_id);
               $artist_obj = new LMPerformer($similar_song_obj->performer_id);
              ?>
              <tr>
                 <td>
                 <?php echo $rank; ?>
                 </td>
                 <td>
                    <a href="<?=SITE_HOST?>/music/song/index.php?song_id=<?=$similar_song_obj->getId()?>">
                       <?php echo $similar_song_obj->getId(); ?>
                    </a>
                 </td>
                 <td>
                    <?php echo $artist_obj->name; ?>
                 </td>
                 <td>
                    <a href="<?=SITE_HOST?>/music/song/index.php?song_id=<?=$similar_song_obj->getId()?>">
                       <?php echo $similar_song_obj->title; ?>
                    </a>
                 </td>
                 <td>
                    <?php echo $similar; ?>
                 </td>
              </tr>
              <?php

               unset($similar_song_obj);
               unset($artist_obj);
            }

         }

        ?>
        </tbody>
   </table>
   <hr />
   <?php
   $music_feature_god = new LMMusicFeatureGod();
   $music_feature_id = $music_feature_god->findBySongId($song_obj->getId());
   if ($music_feature_id) {
      $music_feature_obj = new LMMusicFeature($music_feature_id);
   ?>
   <h2>音樂特徵值</h2>
   <table class="table table-bordered table-striped">
      <thead>
         <tr>
            <th>種類</th>
            <th>Feature</th>
            <th>Value</th>
         </tr>
      </thead>
      <tbody>
         <tr>
            <td rowspan="2"></td>
            <td>echonest_track_id</td>
            <td><?=$song_obj->echonest_track_id?></td>
         </tr>
         <tr>
            <td>key</td>
            <td><?=$song_obj->key?></td>
         </tr>
         <tr>
            <td>調性</td>
            <td>mode</td>
            <td><?=$song_obj->mode?></td>
         </tr>
         <tr>
            <td rowspan="5">力度</td>
            <td>energy</td>
            <td><?=$song_obj->energy?></td>
         </tr>
         <tr>
            <td>loudness</td>
            <td><?=$song_obj->loudness?></td>
         </tr>
         <tr>
            <td>ratio of beat count to bar count</td>
            <td><?=($music_feature_obj->beat_count/$music_feature_obj->bar_count)?></td>
         </tr>
         <tr>
            <td>ratio of tatum count to beat count</td>
            <td><?=($music_feature_obj->tatum_count/$music_feature_obj->beat_count)?></td>
         </tr>
         <tr>
            <td>ratio of tatum count to bar count</td>
            <td><?=($music_feature_obj->tatum_count/$music_feature_obj->bar_count)?></td>
         </tr>
         <tr>
            <td rowspan="9">節奏及速度</td>
            <td>tempo</td>
            <td><?=$song_obj->tempo?></td>
         </tr>
         <tr>
            <td>danceability</td>
            <td><?=$song_obj->danceability?></td>
         </tr>
         <tr>
            <td>time_signature</td>
            <td><?=$song_obj->time_signature?></td>
         </tr>
         <tr>
            <td>tatums per second</td>
            <td><?=(1/$music_feature_obj->tatum_avg_second)?></td>
         </tr>
         <tr>
            <td>beats per second</td>
            <td><?=(1/$music_feature_obj->beat_avg_second)?></td>
         </tr>
         <tr>
            <td>bars per second</td>
            <td><?=(1/$music_feature_obj->bar_avg_second)?></td>
         </tr>
         <tr>
            <td>ratio of avg beat length to avg bar length</td>
            <td><?=($music_feature_obj->beat_avg_second/$music_feature_obj->bar_avg_second)?></td>
         </tr>
         <tr>
            <td>ratio of avg tatum length to avg beat length</td>
            <td><?=($music_feature_obj->tatum_avg_second/$music_feature_obj->beat_avg_second)?></td>
         </tr>
         <tr>
            <td>ratio of avg tatum length to avg bar length</td>
            <td><?=($music_feature_obj->tatum_avg_second/$music_feature_obj->bar_avg_second)?></td>
         </tr>
         <tr>
            <td rowspan="1">音高及音程</td>
            <td colspan="2">
               <h3>pitch_audio_word_histogram</h3>
               <div id="pitch_histogram" style="width: 100%; height: 400px;"></div>
               <script type="text/javascript">
                  var chart;
                  <?php
                  $pitch_array = explode(',',$music_feature_obj->pitch_audio_word_histogram);
                  $pitch_data_array = array();
                  $count = 1;
                  foreach ($pitch_array as $key=>$pitch_value) {
                     $pitch_data = '{ pitch_audio_word: "pitch word '.$count.'", word_count: '.$pitch_value.' }';
                     array_push($pitch_data_array, $pitch_data);
                     $count++;
                  }
                  $pitch_data_array_string = implode(',', $pitch_data_array);
                  ?>
                  var chartData = [<?=$pitch_data_array_string?>];

                  AmCharts.ready(function () {
                     // SERIAL CHART
                     chart = new AmCharts.AmSerialChart();
                     chart.dataProvider = chartData;
                     chart.categoryField = "pitch_audio_word";
                     chart.startDuration = 1;

                     // AXES
                     // category
                     var categoryAxis = chart.categoryAxis;
                     categoryAxis.labelRotation = 90;
                     categoryAxis.gridPosition = "start";
                     categoryAxis.autoGridCount = false;
                     categoryAxis.gridCount = 100000;

                     // value
                     // in case you don't want to change default settings of value axis,
                     // you don't need to create it, as one value axis is created automatically.

                     // GRAPH
                     var graph = new AmCharts.AmGraph();
                     graph.valueField = "word_count";
                     graph.balloonText = "[[category]]: [[value]]";
                     graph.type = "column";
                     graph.lineAlpha = 0;
                     graph.fillAlphas = 0.8;
                     chart.addGraph(graph);

                     chart.write("pitch_histogram");
                  });
               </script>
            </td>
         </tr>
         <tr>
            <td rowspan="2">音色</td>
            <td>speechiness</td>
            <td><?=$song_obj->speechiness?></td>
         </tr>
         <tr>
            <td colspan="2">
               <h3>timbre_audio_word_histogram</h3>
               <div id="timbre_histogram" style="width: 100%; height: 400px;"></div>
               <script type="text/javascript">
                  var chart_t;
                  <?php
                  $timbre_array = explode(',',$music_feature_obj->timbre_audio_word_histogram);
                  $timbre_data_array = array();
                  $count = 1;
                  foreach ($timbre_array as $key=>$timbre_value) {
                     $timbre_data = '{ timbre_audio_word: "timbre word '.$count.'", word_count: '.$timbre_value.' }';
                     array_push($timbre_data_array, $timbre_data);
                     $count++;
                  }
                  $timbre_data_array_string = implode(',', $timbre_data_array);
                  ?>
                  var chartData_t = [<?=$timbre_data_array_string?>];

                  AmCharts.ready(function () {
                     // SERIAL CHART
                     chart_t = new AmCharts.AmSerialChart();
                     chart_t.dataProvider = chartData_t;
                     chart_t.categoryField = "timbre_audio_word";
                     chart_t.startDuration = 1;

                     // AXES
                     // category
                     var categoryAxis = chart_t.categoryAxis;
                     categoryAxis.labelRotation = 90;
                     categoryAxis.gridPosition = "start";
                     categoryAxis.autoGridCount = false;
                     categoryAxis.gridCount = 100000;

                     // value
                     // in case you don't want to change default settings of value axis,
                     // you don't need to create it, as one value axis is created automatically.

                     // GRAPH
                     var graph = new AmCharts.AmGraph();
                     graph.valueField = "word_count";
                     graph.balloonText = "[[category]]: [[value]]";
                     graph.type = "column";
                     graph.lineAlpha = 0;
                     graph.fillAlphas = 0.8;
                     chart_t.addGraph(graph);

                     chart_t.write("timbre_histogram");
                  });
               </script>
            </td>
         </tr>
      </tbody>
   </table>
   <hr />
   <h2>
      相似音樂
   </h2>
   <table class="table table-bordered table-striped">
        <thead>
           <tr>
              <th>
               排名
              </th>
              <th>
               song_id
              </th>
              <th>
               藝人
              </th>
              <th>
               歌名
              </th>
              <th>
               相似度
              </th>
           </tr>
        </thead>
        <tbody>
   <?php
      $similar_song = shell_exec("python26 ".SITE_ROOT."/p-library/model/music_feature/similar_music_model.py ".$_GET['song_id']." ".$model_id);
      $similar_song_array = explode(",", $similar_song);
      $rank = 0;
      foreach ($similar_song_array as $skey => $svalue) {
         $rank++;
         $similar_song_value_array = explode(":", $svalue);
         $similar_song_obj = new LMSong($similar_song_value_array[0]);
         $artist_obj = new LMPerformer($similar_song_obj->performer_id);
         ?>
         <tr>
            <td>
            <?php echo $rank; ?>
            </td>
            <td>
               <a href="<?=SITE_HOST?>/music/song/index.php?song_id=<?=$similar_song_obj->getId()?>">
                  <?php echo $similar_song_obj->getId(); ?>
               </a>
            </td>
            <td>
               <?php echo $artist_obj->name; ?>
            </td>
            <td>
               <a href="<?=SITE_HOST?>/music/song/index.php?song_id=<?=$similar_song_obj->getId()?>">
                  <?php echo $similar_song_obj->title; ?>
               </a>
            </td>
            <td>
               <?php echo $similar_song_value_array[1]; ?>
            </td>
         </tr>
         <?php
         unset($similar_song_obj);
         unset($artist_obj);
      }
   ?>
      </tbody>
   </table>
   <?php
      unset($music_feature_obj);
   }
   ?>
</div>
<?php
   unset($song_obj);
   unset($disc_obj);
   unset($performer_obj);
   unset($lyricist_obj);
   unset($composer_obj);
}
?>
